---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationVendor
source: html/e82fa803-ceef-99b1-2476-2e5aaacaaa82.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationVendor Property

"Vendor"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationVendor { get; }
```